<template>
  <modal-wrapper
    @close="$emit('close')"
    :title="data.title"
    :additional="data"
    :active="active"
    :page="'news'"
  >
    <template #content>
      <div class="news-content" v-html="data.content"></div>
    </template>
  </modal-wrapper>
</template>

<script>
export default {
  name: 'NewsItem',
  meta: {
    crumb: 'Новость',
  },
  data() {
    return {
      content:
        '<p>Предоставление социальной помощи гарантировано государством. Набор социальных услуг (НСУ) - это перечень социальных услуг, предоставляемых отдельным категориям граждан в соответствии с Федеральным законом «О государственной социальной помощи».</p><p>НСУ дает право на:</p><p>- бесплатное получение лекарственных препаратов по рецептам врача;</p><p>- бесплатное санаторно-курортное лечение;</p><p>- бесплатный проезд на пригородном железнодорожном транспорте, а также на междугородном транспорте к месту лечения и обратно.</p><p>Государство предоставляет возможность выбора между НСУ и денежной компенсацией их стоимости.</p><p>Пока здоровье человека не доставляет ему особого беспокойства, и хронические заболевания не обостряются и не прогрессируют, человеку легко поддаться соблазну заменить НСУ денежной компенсацией.</p><p>Как только состояние ухудшается, и болезнь приобретает затяжной характер, требующий длительного лечения и множества лекарств, становится очевидным, что денежной компенсации для лечения недостаточно, особенно при онкологических заболеваниях, сахарном диабете, бронхиальной астме, ревматоидном артрите, хронической почечной недостаточности и т.п.</p><p>Граждане, отказавшиеся от получения полного набора социальных услуг, либо от его лекарственной составляющей, не смогут получать бесплатно необходимые препараты, и у них возникнет необходимость их приобретения за собственные средства. Такая нагрузка для семейного бюджета может оказаться непосильной.</p><p>Если Вами был сделан выбор в пользу денежной компенсации НСУ и Вы убедились, что он был неправильным, Вам необходимо знать: восстановить право на получение НСУ возможно только после подачи соответствующего заявления в Пенсионный фонд.</p><p>Рекомендуем Вам не позднее 1 октября текущего года подать в Пенсионный фонд заявление о возобновлении предоставления НСУ для получения бесплатной лекарственной помощи и других социальных гарантий.</p><p>Гражданам, которые получают НСУ в натуральном выражении (в том числе бесплатные лекарственные препараты), необходимости подачи заявления в Пенсионный фонд нет.</p><p>Право на получение лекарственной составляющей НСУ в натуральной форме жизненно важно!</p><p>Если Вы сохраните за собой право на НСУ, государство обеспечит эффективную защиту Вашего права.</p><p>В течение всей жизни человеку приходится делать выбор. Зачастую, принимая то или иное решение, мы не всегда осознаем его важность или не задумываемся о компенсациях. На первый взгляд, выбор между набором социальных услуг и денежной компенсацией не кажется судьбоносным и люди все чаще выбирают денежное пособие. Но правильно ли это?</p><p>Так сложилось, что мы начинаем задумываться о своем здоровье только в том случае, когда болезнь уже настигла. Заботиться о себе, стараться предупредить недуги - не в наших правилах. То же можно сказать и о решении заменить лекарства денежным пособием.</p><p>В тот момент, когда самочувствие человека не доставляет ему особого беспокойства, хронические заболевания не обостряются и не прогрессируют, ему легко поддаться соблазну заменить натуральные льготы денежным пособием.</p><p>Пациент, имеющий право на льготное обеспечение лекарствами, отказываясь от набора социальных услуг в пользу денежной компенсации, обычно не задумывается о последствиях. Но как только состояние здоровья ухудшается, обостряются хронические заболевания, приобретая затяжной характер, требующий длительного лечения и множества лекарств, или появляются новые заболевания, возникает понимание того, что для полноценного лечения денежной компенсации недостаточно и винить в этом приходится только себя.</p><p>Имея в своей практике много примеров необдуманного отказа от набора социальных услуг, мы считаем своим долгом предупредить Вас о том, что в случае ухудшения здоровья, покупать необходимые медикаменты придется за свой счет. Возможно, сейчас стоимость получаемых вами препаратов не превышает суммы денежной компенсации, но после отказа от НСУ в пользу монетизации и с течением времени может достигать 100 000 рублей и выше.</p>',
    }
  },
  props: {
    active: {
      type: Boolean,
      default: true,
    },
    data: {
      type: Object,
      default: '',
    },
  },
  methods: {},
}
</script>

<style lang="scss">
.news-content {
  max-height: 100%;
  overflow-y: scroll;
  &::-webkit-scrollbar {
    display: none;
  }

  -ms-overflow-style: none;
  scrollbar-width: none;

  //p {
  font-weight: 400;
  font-size: 18px;
  line-height: 24px;
  margin-bottom: 12px;
  color: $gray-1;
  white-space: normal;
  text-align: justify;
  //}

  pre {
    white-space: break-spaces;
  }

  strong,
  b {
    font-weight: 600;
  }

  figure,
  img {
    height: fit-content;
    max-width: 100%;
    object-fit: cover;
    width: 100%;
  }

  > :last-child {
    margin-bottom: 0;
  }
}

@media screen and (max-width: 600px) {
  .news-content {
    font-size: 15px;
    line-height: 140%;
  }
}
</style>
